电脑/python/其他内置模块/unittest模块.html
<!DOCTYPE html>
<html>
<head>
<!-- 2016-01-13 三 20:58 -->
<meta  charset="utf-8">
<meta  name="viewport" content="width=device-width, initial-scale=1">
<title>unittest模块</title>
<meta  name="generator" content="Org-mode">
<meta  name="author" content="万泽(德山书生)">
<meta  name="description" content="制作者邮箱：a358003542@gmail.com"
>
</head>
<body>
<div id="content">
<header>
<h1 class="title">unittest模块</h1>
</header><nav id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#orgheadline1">1. 什么是TDD</a></li>
<li><a href="#orgheadline2">2. 基本的使用</a></li>
<li><a href="#orgheadline3">3. 更详细的函数清单</a></li>
<li><a href="#orgheadline4">4. 参考资料</a></li>
</ul>
</div>
</nav>


<div class="outline-2">
<h2 id="orgheadline1">什么是TDD</h2>
<div class="outline-text-2" id="text-1">
<p>
在编程中有一个概念TDD，其和具体的编程语言无关，其全称叫做test-driven development。也就是人们常说的测试驱动型开发。
</p>

<p>
python语言有一个内置模块用来支持测试式开发，名字叫做 <strong>unittest</strong> 。
</p>
</div>
</div>


<div class="outline-2">
<h2 id="orgheadline2">基本的使用</h2>
<div class="outline-text-2" id="text-2">
<p>
基本的使用就简单用下面这个例子来说明了：
</p>

<div class="highlight"><pre><span class="kn">import</span> <span class="nn">unittest</span>
<span class="kn">import</span> <span class="nn">math</span>

<span class="k">class</span> <span class="nc">TooBigError</span><span class="p">(</span><span class="ne">Exception</span><span class="p">):</span>
    <span class="k">pass</span>

<span class="k">def</span> <span class="nf">hello</span><span class="p">(</span><span class="n">n</span><span class="p">):</span>
    <span class="k">if</span> <span class="n">n</span><span class="o">&gt;</span><span class="mi">2</span><span class="p">:</span>
        <span class="k">raise</span> <span class="n">TooBigError</span><span class="p">(</span><span class="s">&#39;too big input error&#39;</span><span class="p">)</span>
    <span class="k">else</span><span class="p">:</span>
        <span class="k">print</span><span class="p">(</span><span class="s">&#39;hello&#39;</span><span class="o">*</span><span class="n">n</span><span class="p">)</span>

<span class="k">class</span> <span class="nc">FirstTest</span><span class="p">(</span><span class="n">unittest</span><span class="o">.</span><span class="n">TestCase</span><span class="p">):</span>
    <span class="k">def</span> <span class="nf">setUp</span><span class="p">(</span><span class="bp">self</span><span class="p">):</span>
        <span class="sd">&#39;&#39;&#39;setUp函数在每个测试单元执行前被执行，其通常用于预先配置</span>
<span class="sd">        一些后面测试单元会用到的参数&#39;&#39;&#39;</span>
        <span class="k">pass</span>

    <span class="k">def</span> <span class="nf">tearDown</span><span class="p">(</span><span class="bp">self</span><span class="p">):</span>
        <span class="sd">&#39;&#39;&#39;tearDown函数在每个测试单元执行之后再执行。&#39;&#39;&#39;</span>
        <span class="k">pass</span>

    <span class="k">def</span> <span class="nf">test_bool</span><span class="p">(</span><span class="bp">self</span><span class="p">):</span>
        <span class="sd">&#39;&#39;&#39;具体的测试单元，名字需要以test字符开始&#39;&#39;&#39;</span>
        <span class="bp">self</span><span class="o">.</span><span class="n">assertTrue</span><span class="p">(</span><span class="bp">True</span><span class="p">)</span>
        <span class="bp">self</span><span class="o">.</span><span class="n">assertFalse</span><span class="p">(</span><span class="bp">False</span><span class="p">)</span>
    <span class="k">def</span> <span class="nf">test_equal</span><span class="p">(</span><span class="bp">self</span><span class="p">):</span>
        <span class="bp">self</span><span class="o">.</span><span class="n">assertEqual</span><span class="p">(</span><span class="mi">1</span><span class="p">,</span><span class="mi">1</span><span class="p">)</span>
        <span class="bp">self</span><span class="o">.</span><span class="n">assertNotEqual</span><span class="p">(</span><span class="mi">1</span><span class="p">,</span><span class="mi">2</span><span class="p">)</span>
        <span class="bp">self</span><span class="o">.</span><span class="n">assertAlmostEqual</span><span class="p">(</span><span class="n">math</span><span class="o">.</span><span class="n">pi</span><span class="p">,</span> <span class="mf">3.1416</span><span class="p">,</span><span class="mi">4</span><span class="p">)</span>
        <span class="bp">self</span><span class="o">.</span><span class="n">assertNotAlmostEqual</span><span class="p">(</span><span class="n">math</span><span class="o">.</span><span class="n">pi</span><span class="p">,</span> <span class="mf">3.1415</span><span class="p">,</span><span class="mi">4</span><span class="p">)</span>

    <span class="k">def</span> <span class="nf">test_raises</span><span class="p">(</span><span class="bp">self</span><span class="p">):</span>
        <span class="bp">self</span><span class="o">.</span><span class="n">assertRaises</span><span class="p">(</span><span class="n">TooBigError</span><span class="p">,</span> <span class="n">hello</span><span class="p">,</span> <span class="mi">3</span><span class="p">)</span>


<span class="k">if</span> <span class="n">__name__</span> <span class="o">==</span> <span class="s">&#39;__main__&#39;</span><span class="p">:</span>
    <span class="n">unittest</span><span class="o">.</span><span class="n">main</span><span class="p">()</span>
</pre></div>

<ol class="org-ol">
<li>unittest模块的main函数具体实际执行各个测试单元类，这些测试单元类继承自unittest的TestCase类。在这些继承自TestCase的类中，setUp函数和tearDown函数有特殊的用途，具体见上面代码的说明。然后里面定义的函数test字符串开头的都是所谓的测试单元，其将被逐个执行。</li>
</ol>
<ol class="org-ol">
<li>TestCase有很多方法，比如assertTrue，assertFalse用于断言某个bool值是真或假，然后assertEqual用来断言某两个值是相等的(==)，类似的还有assertNotEqual用来断言两个值不相等。这里值得一提的assertAlmostEqual方法是用来断言某两个float值在多少小数位上是大致相等的，比如上面的例子， \(\pi\) 值具体到小数点4位是3.1416。上面这些方法后面还可以额外接受一个提示字符串参数（Msg参数），用来具体没有断言成功的时的补充信息。</li>

<li>assertRaises方法用来断言某个函数在接受某些参数之后必然返回某个异常。该方法第一个参数是期望捕捉到的异常，第二个参数是具体调用的函数，后面的参数将送给这个函数，所以就不能跟之前谈及的Msg参数了。</li>
</ol>
</div>
</div>





<div class="outline-2">
<h2 id="orgheadline3">更详细的函数清单</h2>
<div class="outline-text-2" id="text-3">
<p>
下面列出由 <code>TestCase</code> 类提供的一些用于判断的函数:
</p>

<ul class="org-ul">
<li>assertEqual(a, b) check for a == b</li>
<li></li>
</ul>
</div>
</div>

<div class="outline-2">
<h2 id="orgheadline4">参考资料</h2>
<div class="outline-text-2" id="text-4">
<ol class="org-ol">
<li>Dive Into Python 3 － unit testing 一章。</li>
<li>Testing Python  ，作者：DAVID SALE ，2014年</li>
</ol>
</div>
</div>
</div>
</body>
</html>
